#!/bin/bash
read directory #-------------------------------------------------------------------------Считывание пути директории
echo "Общий анализ директории $directory" #----------------------------------------------Строка с информацией
count_all_files=$(ls -lah "$directory" | tail -n +2 | wc -l) #---------------------------Вывод количества всех объектов
echo "Всего объектов: $count_all_files" #------------------------------------------------Строка с информацией
count_files=$(ls -p "$directory" | grep -v / | wc -l) #----------------------------------Вывод количества файлов
echo "Обычные файлы: $count_files" #-----------------------------------------------------Строка с информацией
count_directory=$(ls -la "$directory" | grep "^d" | tail -n +2 | wc -l) #----------------Вывод количества директорий 
echo "Директории: $count_directory" #----------------------------------------------------Строка с информацией
count_hidden=$(ls -la "$directory" | grep "^\." | wc -l) #-------------------------------Вывод количества скрытых файлов
echo "Скрытые файлы: $count_hidden" #----------------------------------------------------Строка с информацией
